'''(А. Куканова) Рассматривается множество целых чисел, принадлежащих числовому отрезку [1871; 9197], которые удовлетворяют следующим условиям:
− количество цифр в шестнадцатеричной и десятичной записях числа не совпадает;
− остаток от деления на 9 равен 2 или 4.
Найдите количество таких чисел и минимальное из них.'''

k = 0
mn = 1000000
for i in range(1871, 9197 + 1):
  counter_for_16 = 0
  counter_for_10 = 0
  number_for_16 = i
  number_for_10 = i
  while number_for_16 > 0:
    counter_for_16 += 1
    number_for_16 //= 16
  while number_for_10 > 0:
    counter_for_10 += 1
    number_for_10 //= 10
  if counter_for_16 != counter_for_10:
    if i % 9 == 2 or i % 9 == 4:
      k += 1
      if i < mn:
        mn = i
print(k,mn)
